//Створіть дві змінні для зберігання значень двох текстових полів. Перевірте, чи обидві змінні не є порожніми. Якщо обидва поля заповнені, вивести повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

// let field1 = prompt("Введіть значення першого поля:");
// let field2 = prompt("Введіть значення другого поля:");

// if (field1.trim() !== "" && field2.trim() !== ""){
// alert("Обидва поля заповнені");
// }else{
//  alert("Не всі поля заповнені");
// }



//Створіть дві змінні для зберігання числових значень. Обчисліть їх суму. Якщо сума більше 10 — виведіть "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

// let num1 = Number(prompt("Введіть перше число:"));
// let num2 = Number(prompt("Введіть друге число:"));

// let sum = num1 + num2

// if(sum > 10){
// alert("сума більше 10")
// } else{
//  alert("Сума менша або дорівнює 10")
// }



// Створіть змінну для зберігання тексту. Перевірте, чи містить цей текст слово "JavaScript". Якщо містить, виведіть "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

// let text = prompt("ведіть текст")
// if (text.includes("JavaScript")) {
//  alert("Текст містить слово JavaScript");
// }else {
//   alert("Текст не містить слово JavaScript");
// }


// Створіть змінну для зберігання числа. Перевірте, чи це число більше 10 і менше 20. Якщо так — виведіть "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".


let number = Number(prompt("ведіть число"))  
if (number > 10 && number < 20) {
  alert("Число входить в діапазон від 10 до 20");
}else {
  alert("Число не входить в діапазон від 10 до 20");
}